
Final Project - new changes start halfway through, midterm project base has edits for clarity


Import Libraries

`python -m pip install pymongo[srv]`

additionally, please download https://dev.mysql.com/doc/index-other.html, 

Specifically, the sakila database

The other database is "sample_mflix" in MongoDB (one of the free samples that you can add to clusters)

In total, used 4 data-sets,
Northwind_DW (for dim_date),
Sample_mflix (from MongoDB),
Sakila database (from mySQL link),
Attached Top_1000_IMBD.csv

In [92]:
import os
import json
import numpy
import datetime
import certifi
import pandas as pd

import pymongo
import sqlalchemy
from sqlalchemy import create_engine, text

print(f"Running SQL Alchemy Version: {sqlalchemy.__version__}")
print(f"Running PyMongo Version: {pymongo.__version__}")

Running SQL Alchemy Version: 2.0.45
Running PyMongo Version: 4.15.4

#### Declare & Assign Connection Variables for the MongoDB Server, the MySQL Server & Databases with which You'll be Working

In [ ]:
mysql_args = {
    "uid": "root",
    "pwd" : "Weiao123.1",  
    "hostname": "localhost",
    "dbname": "sakila"   
}

# The 'cluster_location' must either be "atlas" or "local".
mongodb_args = {
    "user_name" : "patrickyin3",
    "password" : "patrickyin3",
    "cluster_name" : "ds2002",
    "cluster_subnet" : "whjs4xu",
    "cluster_location" : "atlas", # "local"
    "db_name" : "sample_mflix"  #USED SAMPLE_MFLIX IN MONGODB (free dataset)
}

mysql_args_nw = {
    "uid": "root",
    "pwd" : "Weiao123.1",
    "hostname": "localhost",
    "dbname": "northwind_dw" 
}

Define Functions for Getting Data From and Setting Data Into Databases

In [94]:
def get_sql_dataframe(sql_query, **args):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{args['uid']}:{args['pwd']}@{args['hostname']}/{args['dbname']}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    dframe = pd.read_sql(text(sql_query), connection);
    connection.close()
    
    return dframe
    

def set_dataframe(df, table_name, pk_column, db_operation, **args):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{args['uid']}:{args['pwd']}@{args['hostname']}/{args['dbname']}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        connection.execute(text(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});"))
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()


def get_mongo_client(**args):
    '''Validate proper input'''
    if args["cluster_location"] not in ['atlas', 'local']:
        raise Exception("You must specify either 'atlas' or 'local' for the cluster_location parameter.")
    
    else:
        if args["cluster_location"] == "atlas":
            connect_str = f"mongodb+srv://{args['user_name']}:{args['password']}@"
            connect_str += f"{args['cluster_name']}.{args['cluster_subnet']}.mongodb.net"
            client = pymongo.MongoClient(connect_str, tlsCAFile=certifi.where())
            
        elif args["cluster_location"] == "local":
            client = pymongo.MongoClient("mongodb://localhost:27017/")
        
    return client


def get_mongo_dataframe(mongo_client, db_name, collection, query):
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = mongo_client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    mongo_client.close()
    
    return dframe


def set_mongo_collections(mongo_client, db_name, data_directory, json_files):
    db = mongo_client[db_name]
    
    for file in json_files:
        db.drop_collection(file)
        json_file = os.path.join(data_directory, json_files[file])
        with open(json_file, 'r') as openfile:
            json_object = json.load(openfile)
            file = db[file]
            result = file.insert_many(json_object)
        
    mongo_client.close()

### Load Date Dimension Data From Source Database

In [109]:
sql_date = "SELECT * FROM dim_date;"
df_dim_date = get_sql_dataframe(sql_date, **mysql_args_nw)

# Keep only relevant columns
cols_date = ['date_key', 'full_date', 'day_of_week', 'day_name_of_week',
             'day_of_month', 'day_of_year', 'weekday_weekend', 'month_of_year', 
             'calendar_year', 'calendar_quarter', 'fiscal_year', 'fiscal_quarter']

df_dim_date = df_dim_date[[c for c in cols_date if c in df_dim_date.columns]]

set_dataframe(df_dim_date, table_name='dim_date', pk_column='date_key', db_operation='insert', **mysql_args)

df_dim_date.head(5)

,date_key,full_date,day_of_week,day_name_of_week,day_of_month,day_of_year,weekday_weekend,month_of_year,calendar_year,calendar_quarter,fiscal_year,fiscal_quarter
0,20000101,2000-01-01,7,Saturday,1,1,Weekend,1,2000,1,2000,3
1,20000102,2000-01-02,1,Sunday,2,2,Weekend,1,2000,1,2000,3
2,20000103,2000-01-03,2,Monday,3,3,Weekday,1,2000,1,2000,3
3,20000104,2000-01-04,3,Tuesday,4,4,Weekday,1,2000,1,2000,3
4,20000105,2000-01-05,4,Wednesday,5,5,Weekday,1,2000,1,2000,3

### Import IMDb Top 1000 Dataset From Local CSV File

In [110]:
#import imdb_top_1000.csv from local

import os
import pandas as pd


base_dir = os.path.dirname(os.path.abspath("__file__"))  
csv_path = os.path.join(base_dir, "imdb_top_1000.csv")

df_imdb = pd.read_csv(csv_path)
df_imdb.head(3)

,Poster_Link,Series_Title,Released_Year,Certificate,Runtime,Genre,IMDB_Rating,Overview,Meta_score,Director,Star1,Star2,Star3,Star4,No_of_Votes,Gross
0,https://m.media-amazon.com/images/M/MV5BMDFkYT...,The Shawshank Redemption,1994,A,142 min,Drama,9.3,Two imprisoned men bond over a number of years...,80.0,Frank Darabont,Tim Robbins,Morgan Freeman,Bob Gunton,William Sadler,2343110,"28,341,469"
1,https://m.media-amazon.com/images/M/MV5BM2MyNj...,The Godfather,1972,A,175 min,"Crime, Drama",9.2,An organized crime dynasty's aging patriarch t...,100.0,Francis Ford Coppola,Marlon Brando,Al Pacino,James Caan,Diane Keaton,1620367,"134,966,411"
2,https://m.media-amazon.com/images/M/MV5BMTMxNT...,The Dark Knight,2008,UA,152 min,"Action, Crime, Drama",9.0,When the menace known as the Joker wreaks havo...,84.0,Christopher Nolan,Christian Bale,Heath Ledger,Aaron Eckhart,Michael Caine,2303232,"534,858,444"

### Transform IMDb Dataset and Load IMDb Dimension Table

In [111]:
# Keep relevant columns and rename
cols_imdb = ['Series_Title', 'Released_Year', 'Certificate', 'Runtime', 'Genre',
             'IMDB_Rating', 'Meta_score', 'Overview', 'Director', 'Star1', 'Star2', 'Star3', 'Star4', 'No_of_Votes', 'Gross']
df_imdb = df_imdb[[c for c in cols_imdb if c in df_imdb.columns]]

df_imdb.rename(columns={
    'Series_Title': 'title',
    'Released_Year': 'year',
    'IMDB_Rating': 'imdb_rating',
    'Meta_score': 'metascore',
    'No_of_Votes': 'imdb_votes',
    'Gross': 'gross',
    'Star1': 'cast_1',
    'Star2': 'cast_2',
    'Star3': 'cast_3',
    'Star4': 'cast_4'
}, inplace=True)

# Add surrogate key
df_imdb.insert(0, 'movie_key', range(1, df_imdb.shape[0]+1))

# Keep final columns for MySQL
df_dim_imdb = df_imdb[['movie_key', 'title', 'year', 'Certificate', 'Runtime', 'Genre',
                        'Director', 'cast_1', 'cast_2', 'cast_3', 'cast_4', 'imdb_rating',
                        'metascore', 'imdb_votes', 'gross', 'Overview']]

# Insert into MySQL
set_dataframe(df_dim_imdb, table_name='dim_imdb_top_1000', pk_column='movie_key', db_operation='insert', **mysql_args)

# Verify
df_imdb_mysql = get_sql_dataframe("SELECT * FROM dim_imdb_top_1000 LIMIT 5;", **mysql_args)
df_imdb_mysql.head(5)

,movie_key,title,year,Certificate,Runtime,Genre,Director,cast_1,cast_2,cast_3,cast_4,imdb_rating,metascore,imdb_votes,gross,Overview
0,1,The Shawshank Redemption,1994,A,142 min,Drama,Frank Darabont,Tim Robbins,Morgan Freeman,Bob Gunton,William Sadler,9.3,80.0,2343110,"28,341,469",Two imprisoned men bond over a number of years...
1,2,The Godfather,1972,A,175 min,"Crime, Drama",Francis Ford Coppola,Marlon Brando,Al Pacino,James Caan,Diane Keaton,9.2,100.0,1620367,"134,966,411",An organized crime dynasty's aging patriarch t...
2,3,The Dark Knight,2008,UA,152 min,"Action, Crime, Drama",Christopher Nolan,Christian Bale,Heath Ledger,Aaron Eckhart,Michael Caine,9.0,84.0,2303232,"534,858,444",When the menace known as the Joker wreaks havo...
3,4,The Godfather: Part II,1974,A,202 min,"Crime, Drama",Francis Ford Coppola,Al Pacino,Robert De Niro,Robert Duvall,Diane Keaton,9.0,90.0,1129952,"57,300,000",The early life and career of Vito Corleone in ...
4,5,12 Angry Men,1957,U,96 min,"Crime, Drama",Sidney Lumet,Henry Fonda,Lee J. Cobb,Martin Balsam,John Fiedler,9.0,96.0,689845,"4,360,000",A jury holdout attempts to prevent a miscarria...

### Transform MongoDB Movie Data and Load Movies Dimension Table

In [112]:
import numpy as np
import pandas as pd

# DIM MOVIES (MongoDB)

client = get_mongo_client(**mongodb_args)
df_movies = get_mongo_dataframe(client, mongodb_args["db_name"], "embedded_movies", {})
client.close()

# Rename primary key and keep relevant columns
df_movies.rename(columns={'_id': 'movie_id'}, inplace=True)
cols_movies = ['movie_id', 'title', 'year', 'runtime', 'genres', 'directors', 'cast', 'metacritic']
df_movies = df_movies[[c for c in cols_movies if c in df_movies.columns]]

# Convert list columns to comma-separated strings
for col in ['genres', 'directors', 'cast']:
    if col in df_movies.columns:
        df_movies[col] = df_movies[col].apply(lambda x: ', '.join(x) if isinstance(x, list) else x)

# Add surrogate key
df_movies.insert(0, 'movie_key', range(1, df_movies.shape[0]+1))

# Keep only dimension columns
df_dim_movies = df_movies[['movie_key', 'title', 'year', 'runtime', 'genres', 'directors', 'cast', 'metacritic']]

# Insert into MySQL
set_dataframe(df_dim_movies, table_name='dim_movies', pk_column='movie_key', db_operation='insert', **mysql_args)

# Verify
df_movies_mysql = get_sql_dataframe("SELECT * FROM dim_movies LIMIT 5;", **mysql_args)
df_movies_mysql.head(5)

,movie_key,title,year,runtime,genres,directors,cast,metacritic
0,1,Men Without Women,1930,77.0,"Action, Drama",John Ford,"Kenneth MacKenna, Frank Albertson, J. Farrell ...",None
1,2,For Heaven's Sake,1926,58.0,"Action, Comedy, Romance",Sam Taylor,"Harold Lloyd, Jobyna Ralston, Noah Young, Jim ...",None
2,3,The Mark of Zorro,1940,94.0,"Action, Adventure, Romance",Rouben Mamoulian,"Tyrone Power, Linda Darnell, Basil Rathbone, G...",None
3,4,Beau Geste,1926,101.0,"Action, Adventure, Drama",Herbert Brenon,"Ronald Colman, Neil Hamilton, Ralph Forbes, Al...",None
4,5,North West Mounted Police,1940,126.0,"Action, Adventure, Drama",Cecil B. DeMille,"Gary Cooper, Madeleine Carroll, Paulette Godda...",None

### Extract User Data From MongoDB and Load Users Dimension Table

In [113]:
# DIM USERS (MongoDB)

client = get_mongo_client(**mongodb_args)
df_users = get_mongo_dataframe(client, mongodb_args["db_name"], "users", {})
client.close()

# Rename primary key and keep relevant columns
df_users.rename(columns={'_id': 'user_id'}, inplace=True)
cols_users = ['user_id', 'name', 'email']
df_users = df_users[[c for c in cols_users if c in df_users.columns]]

# Add surrogate key
df_users.insert(0, 'user_key', range(1, df_users.shape[0]+1))

# Keep only dimension columns
df_dim_users = df_users[['user_key', 'name', 'email']]

# Insert into MySQL
set_dataframe(df_dim_users, 'dim_users', 'user_key', 'insert', **mysql_args)

# Verify
df_users_mysql = get_sql_dataframe("SELECT * FROM dim_users LIMIT 5;", **mysql_args)
df_users_mysql.head(5)

   user_key             name                                  email
0         1       Bran Stark  isaac_hempstead_wright@gameofthron.es
1         2      Sansa Stark           sophie_turner@gameofthron.es
2         3   Sandor Clegane             rory_mccann@gameofthron.es
3         4  Jaime Lannister   nikolaj_coster-waldau@gameofthron.es
4         5    Catelyn Stark        michelle_fairley@gameofthron.es

### Extract Comment Data From MongoDB and Load Comments Fact Table

In [114]:
# FACT COMMENTS (MongoDB)

client = get_mongo_client(**mongodb_args)
df_comments = get_mongo_dataframe(client, mongodb_args["db_name"], "comments", {})
client.close()

# Rename primary key and keep relevant columns
df_comments.rename(columns={'_id': 'comment_id'}, inplace=True)
cols_comments = ['comment_id', 'text', 'date', 'movie_id', 'user_id']
df_comments = df_comments[[c for c in cols_comments if c in df_comments.columns]]

# Add surrogate key
df_comments.insert(0, 'comment_key', range(1, df_comments.shape[0]+1))

# Map user_key and movie_key 
df_comments['user_key'] = np.random.choice(df_dim_users['user_key'], size=len(df_comments))
df_comments['movie_key'] = np.random.choice(df_dim_movies['movie_key'], size=len(df_comments))

# Keep only fact table columns
df_fact_comments = df_comments[['comment_key', 'movie_key', 'user_key', 'text', 'date']]

# Insert into MySQL
set_dataframe(df_fact_comments, 'fact_comments', 'comment_key', 'insert', **mysql_args)

# Verify
df_fact_comments_mysql = get_sql_dataframe("SELECT * FROM fact_comments LIMIT 5;", **mysql_args)
df_fact_comments_mysql.head(5)

,comment_key,movie_key,user_key,text,date
0,1,760,148,Hic corporis illo adipisci similique. Omnis te...,2006-03-07 07:15:16
1,2,517,160,Nobis incidunt ea tempore cupiditate sint. Ita...,2012-11-26 11:00:57
2,3,1702,131,Voluptatum voluptatem nam et accusamus ullam q...,2015-02-08 01:28:23
3,4,1657,120,Illo nihil occaecati minima facere ea nemo. Mo...,1976-12-18 08:14:46
4,5,730,68,Minima odit officiis minima nam. Aspernatur id...,1981-11-08 04:32:25

### Extract Sakila Data and Load Actor, Film, and Film-Actor Tables

In [115]:
# SAKILA ETL (MySQL)

#DIM ACTOR
df_actor = get_sql_dataframe("SELECT * FROM actor;", **mysql_args)
df_actor.insert(0, 'actor_key', range(1, len(df_actor)+1))
df_dim_actor = df_actor[['actor_key', 'first_name', 'last_name']]
set_dataframe(df_dim_actor, 'dim_actor', 'actor_key', 'insert', **mysql_args)

#DIM FILM
df_film = get_sql_dataframe("SELECT * FROM film;", **mysql_args)
df_film.insert(0, 'film_key', range(1, len(df_film)+1))
df_dim_film = df_film[['film_key', 'title', 'release_year', 'rating', 'length']]
set_dataframe(df_dim_film, 'dim_film', 'film_key', 'insert', **mysql_args)

#FACT FILM_ACTOR
df_film_actor = get_sql_dataframe("SELECT * FROM film_actor;", **mysql_args)
film_map = dict(zip(df_film['film_id'], df_dim_film['film_key']))
actor_map = dict(zip(df_actor['actor_id'], df_dim_actor['actor_key']))

df_film_actor['film_key'] = df_film_actor['film_id'].map(film_map)
df_film_actor['actor_key'] = df_film_actor['actor_id'].map(actor_map)

df_fact_film_actor = df_film_actor[['film_key', 'actor_key']]
df_fact_film_actor.insert(0, 'film_actor_key', range(1, len(df_fact_film_actor)+1))

set_dataframe(df_fact_film_actor, 'fact_film_actor', 'film_actor_key', 'insert', **mysql_args)

# Verify
df_fact_film_actor_mysql = get_sql_dataframe("SELECT * FROM fact_film_actor LIMIT 5;", **mysql_args)
df_fact_film_actor_mysql.head(5)

   film_actor_key  film_key  actor_key
0               1         1          1
1               2        23          1
2               3        25          1
3               4       106          1
4               5       140          1

### Query Top 5 User–Movie Combinations by Total Comments

In [116]:
# QUERY 1: Total Comments per User per Movie 
# This query joins fact_comments, dim_users, and dim_movies to find how many comments each user has made per movie. It shows the top 5 user–movie combinations with the most comments.

sql_comments_per_user_movie = """
SELECT
    u.user_key,
    u.name AS user_name,
    m.movie_key,
    m.title AS movie_title,
    COUNT(c.comment_key) AS total_comments
FROM
    fact_comments c
JOIN
    dim_users u ON c.user_key = u.user_key
JOIN
    dim_movies m ON c.movie_key = m.movie_key
GROUP BY
    u.user_key, u.name, m.movie_key, m.title
ORDER BY
    total_comments DESC
LIMIT 20;
"""

df_comments_per_user_movie = get_sql_dataframe(sql_comments_per_user_movie, **mysql_args)
df_comments_per_user_movie.head(5)

,user_key,user_name,movie_key,movie_title,total_comments
0,35,Tywin Lannister,159,Live and Let Die,3
1,49,Tommen Baratheon,394,Clear and Present Danger,3
2,48,Ramsay Bolton,3166,Days of Darkness,3
3,128,Barbara Gonzalez,1783,Seeking Justice,3
4,7,Jon Snow,717,Love's Enduring Promise,3

### Compute Average IMDb Rating per User Based on Their Comments

In [117]:
#QUERY 2: Average IMDb Rating per User
# This query computes the average IMDb rating of all movies commented on by each user. It joins fact_comments, dim_users, and dim_imdb_top_1000 and returns the top 5 users ranked by their average movie rating.

sql_avg_rating_per_user = """
SELECT
    u.user_key,
    u.name AS user_name,
    COUNT(c.comment_key) AS total_comments,
    AVG(m.imdb_rating) AS avg_imdb_rating
FROM
    fact_comments c
JOIN
    dim_users u ON c.user_key = u.user_key
JOIN
    dim_imdb_top_1000 m ON c.movie_key = m.movie_key
GROUP BY
    u.user_key, u.name
ORDER BY
    avg_imdb_rating DESC
LIMIT 20;
"""

df_avg_rating_per_user = get_sql_dataframe(sql_avg_rating_per_user, **mysql_args)
df_avg_rating_per_user.head(5)

   user_key         user_name  total_comments  avg_imdb_rating
0        57              Irri              64         8.035938
1       156    Bradley Brooks              70         8.017143
2        71       Janos Slynt              54         8.014815
3       145  Nicholas Webster              59         8.013559
4       136   Phillip Collins              68         8.011765

### Analyze Sakila Customers by Total Comments and Average IMDb Ratings

In [118]:
#QUERY 3: Comments and Average Ratings by Sakila Customers
# This query integrates the Sakila database by linking users to Sakila customers (matching by user_key). It shows, for each customer, the total number of comments and the average IMDb rating of the movies they commented on.

sql_comments_sakila = """
SELECT
    cust.customer_id,
    cust.first_name,
    cust.last_name,
    COUNT(c.comment_key) AS total_comments,
    AVG(m.imdb_rating) AS avg_movie_rating
FROM
    fact_comments c
JOIN
    dim_users u ON c.user_key = u.user_key
JOIN
    dim_imdb_top_1000 m ON c.movie_key = m.movie_key
JOIN
    sakila.customer cust ON cust.customer_id = u.user_key
GROUP BY
    cust.customer_id, cust.first_name, cust.last_name
ORDER BY
    total_comments DESC
LIMIT 20;
"""

df_comments_sakila = get_sql_dataframe(sql_comments_sakila, **mysql_args)
df_comments_sakila.head(5)

   customer_id first_name last_name  total_comments  avg_movie_rating
0            7      MARIA    MILLER              98          7.958163
1           38     MARTHA  GONZALEZ              91          7.949451
2           76      IRENE     PRICE              81          7.946914
3          162     LAUREN    HUDSON              80          7.965000
4          119     SHERRY  MARSHALL              80          7.945000

## Final Project Changes
### Initialize PySpark and Create Database

In [119]:
import os
import pandas as pd
import numpy as np
from pyspark.sql import SparkSession
from pyspark.sql.functions import col, count, avg, explode, split


spark = SparkSession.builder \
    .appName("MovieDLH") \
    .config("spark.sql.warehouse.dir", os.path.abspath("spark-warehouse")) \
    .getOrCreate()
spark.sparkContext.setLogLevel("OFF")

dest_database = "movie_dlh"
spark.sql(f"DROP DATABASE IF EXISTS {dest_database} CASCADE")
spark.sql(f"CREATE DATABASE IF NOT EXISTS {dest_database}")

DataFrame[]

### Convert Pandas DataFrames to Spark DataFrames

In [120]:
spark_dim_movies      = spark.createDataFrame(df_dim_movies)
spark_dim_imdb        = spark.createDataFrame(df_imdb)
spark_dim_users       = spark.createDataFrame(df_dim_users)
spark_fact_comments   = spark.createDataFrame(df_fact_comments)
spark_dim_actor       = spark.createDataFrame(df_dim_actor)
spark_dim_film        = spark.createDataFrame(df_dim_film)
spark_fact_film_actor = spark.createDataFrame(df_fact_film_actor)
spark_dim_date        = spark.createDataFrame(df_dim_date)

### Save all Bronze-layer tables as managed Spark tables

In [121]:
spark_dim_movies.write.saveAsTable(f"{dest_database}.bronze_dim_movies", mode="overwrite")
spark_dim_imdb.write.saveAsTable(f"{dest_database}.bronze_dim_imdb", mode="overwrite")
spark_dim_users.write.saveAsTable(f"{dest_database}.bronze_dim_users", mode="overwrite")
spark_fact_comments.write.saveAsTable(f"{dest_database}.bronze_fact_comments", mode="overwrite")
spark_dim_actor.write.saveAsTable(f"{dest_database}.bronze_dim_actor", mode="overwrite")
spark_dim_film.write.saveAsTable(f"{dest_database}.bronze_dim_film", mode="overwrite")
spark_fact_film_actor.write.saveAsTable(f"{dest_database}.bronze_fact_film_actor", mode="overwrite")
spark_dim_date.write.saveAsTable(f"{dest_database}.bronze_dim_date", mode="overwrite")

### Create Silver-layer table by enriching fact tables with dimension data and basic aggregates

In [ ]:
#Silver Layer: Comments with Users & Movies
spark_silver_comments = spark_fact_comments \
    .join(spark_dim_movies, "movie_key") \
    .join(spark_dim_users, "user_key")
spark_silver_comments.write.saveAsTable(f"{dest_database}.silver_comments", mode="overwrite")

#Silver Layer: Movies enriched with IMDb ratings
spark_silver_movies = spark_dim_movies.join(
    spark_dim_imdb[['movie_key', 'imdb_rating', 'metascore', 'imdb_votes']],
    on='movie_key',
    how='left'
)
spark_silver_movies.write.saveAsTable(f"{dest_database}.silver_movies", mode="overwrite")

#Silver Layer: Users with aggregated info (comments count)
spark_silver_users = spark_fact_comments.groupBy("user_key") \
    .agg(count("comment_key").alias("num_comments"))
spark_silver_users = spark_silver_users.join(spark_dim_users, "user_key")
spark_silver_users.write.saveAsTable(f"{dest_database}.silver_users", mode="overwrite")

#Silver Layer: Film-Actor enriched
spark_silver_film_actor = spark_fact_film_actor \
    .join(spark_dim_actor, "actor_key") \
    .join(spark_dim_film, "film_key")
spark_silver_film_actor.write.saveAsTable(f"{dest_database}.silver_film_actor", mode="overwrite")

### Gold Layer: aggregate silver tables for reporting

In [ ]:
#Gold: Movie Comments Aggregation
gold_movie_comments = spark_silver_comments.groupBy("movie_key", "title") \
    .agg(count("comment_key").alias("num_comments")) \
    .orderBy(col("num_comments").desc())
gold_movie_comments.write.saveAsTable(f"{dest_database}.gold_movie_comments", mode="overwrite")
gold_movie_comments.write.mode("overwrite").parquet(f"{dest_database}/gold/movie_comments")

#Gold: User Average Ratings & Comment Counts
gold_user_avg_rating = spark_silver_comments.join(
    spark_dim_imdb.select("movie_key", "imdb_rating"),
    on="movie_key",
    how="left"
).groupBy("user_key", "name") \
 .agg(
    avg("imdb_rating").alias("avg_imdb_rating"),
    count("comment_key").alias("num_comments")
 ).orderBy(col("avg_imdb_rating").desc())
gold_user_avg_rating.write.saveAsTable(f"{dest_database}.gold_user_avg_rating", mode="overwrite")
gold_user_avg_rating.write.mode("overwrite").parquet(f"{dest_database}/gold/user_avg_rating")

#Gold: Genre-Level Aggregation
gold_genre_summary = spark_silver_movies.withColumn(
    "genre", explode(split(col("genres"), ", "))
).groupBy("genre") \
 .agg(
    avg("imdb_rating").alias("avg_rating"),
    count("movie_key").alias("num_movies")
 ).orderBy(col("num_movies").desc())
gold_genre_summary.write.saveAsTable(f"{dest_database}.gold_genre_summary", mode="overwrite")
gold_genre_summary.write.mode("overwrite").parquet(f"{dest_database}/gold/genre_summary")

### Display sample rows from Gold tables for verification

In [125]:
print("Top Movies by Comment Count:")
gold_movie_comments.show(5, truncate=False)

print("Top Users by Avg IMDb Rating:")
gold_user_avg_rating.show(5, truncate=False)

print("Top Genres by Movie Count:")
gold_genre_summary.show(5, truncate=False)

Top Movies by Comment Count:
+---------+-------------------------+------------+
|movie_key|title                    |num_comments|
+---------+-------------------------+------------+
|2413     |The Misfits              |26          |
|3153     |Les enfants de Timpelbach|25          |
|2120     |Banklady                 |25          |
|1410     |Strigoi                  |24          |
|1309     |Princess Arete           |24          |
+---------+-------------------------+------------+
only showing top 5 rows

Top Users by Avg IMDb Rating:
+--------+----------------+-----------------+------------+
|user_key|name            |avg_imdb_rating  |num_comments|
+--------+----------------+-----------------+------------+
|57      |Irri            |8.0359375        |217         |
|156     |Bradley Brooks  |8.017142857142858|238         |
|71      |Janos Slynt     |8.014814814814818|226         |
|145     |Nicholas Webster|8.013559322033899|225         |
|136     |Phillip Collins |8.011764705882356|212         |
+--------+----------------+-----------------+------------+
only showing top 5 rows

Top Genres by Movie Count:
+---------+-----------------+----------+
|genre    |avg_rating       |num_movies|
+---------+-----------------+----------+
|Action   |8.00302663438263 |2381      |
|Drama    |7.960050890585232|1271      |
|Fantasy  |7.760540540540552|1055      |
|Adventure|8.016981132075468|923       |
|Comedy   |7.926940639269399|887       |
+---------+-----------------+----------+
only showing top 5 rows